class DefaultContext:
    CONVERT_VIDEO = {
        "title": "Конвертировать видео MP4, AVI, MOV, MKV, VMW в другой формат."
                 "Онлайн-инструмент для конвертации видео любого типа | Media-Editor",
        "description":
            """Конвертируйте видео в MP4, AVI, MOV, MKV, VMW онлайн бесплатно, поменяйте формат видео онлайн,
                                       бесплатно сменить формат у видео.""",
        "keywords": "конвертировать видео, "
                    "конвертировать видео онлайн, "
                    "конвертируем видео в mp4, "
                    "конвертировать видео бесплатно, "
                    "конвертировать видео онлайн бесплатно, "
                    "конвертировать видео +в mp4 онлайн, "
                    "изменять видео формат, "
                    "изменить формат видео онлайн, "
                    "изменить формат видео онлайн +в mp4",
        "display_metric": True,
    }

    CONVERT_IMAGE = {
        "title": "Конвертировать фото JPG, JPEG, PNG, WEBP в другой формат."
                 "Онлайн-инструмент для конвертации картинок любого типа | Media-Editor",
        "description":
            """Конвертируйте картинки в JPG, JPEG, PNG, WEBP онлайн бесплатно, поменяйте формат изображения онлайн,
                                       бесплатно сменить формат у фото.""",
        "keywords": "изменить формат картинки, "
                    "изменить формат картинки онлайн, "
                    "конвертировать картинку, "
                    "конвертировать картинку онлайн, "
                    "конвертировать картинку онлайн бесплатно, "
                    "конвертировать картинку в jpg онлайн, "
                    "конвертировать картинку в jpg,",
        "display_metric": True,
    }

    CONVERT_VIDEO_TO_GIF = {
            "title": "Конвертируйте видео в GIF. Онлайн-инструмент для конвертации видео в гиф | Media-Editor",
            "description": """Сделайте GIF-анимацию из видео онлайн бесплатно, конвертируйте видеофайл в gif.""",
            "keywords": "видео в gif, "
                        "сделать gif из видео, "
                        "создать gif +из видео, "
                        "сделать gif онлайн из видео, "
                        "видео в gif онлайн, "
                        "конвертировать видео в gif,"
                        "перевести gif в видео",
            "display_metric": True,
        }
